---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.Erase(Autodesk.Revit.DB.Parameter)
source: html/07767b2b-153a-1914-3eeb-4996ce72aacc.htm
---
# Autodesk.Revit.DB.ParameterSet.Erase Method

Removes a specified parameter from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	Parameter item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Parameter`) - The parameter to be erased.

## Returns
The number of parameters that were erased from the set.